app/controllers/ideas_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 2]]
---
  def show
    @comments = @idea.comments.all

INSERT INTO "ideas" ("name", "description", "picture", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?, ?, ?)  [["name", "dua"], ["description", "i am a student"], ["picture", "hong.jpg"], ["created_at", "2017-09-16 08:41:27.460817"], ["updated_at", "2017-09-16 08:41:27.460817"], ["title", "hi"]]
---
  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save

UPDATE "ideas" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["name", "Thơm"], ["description", "Một góc nhỏ Nhật Bản"], ["updated_at", "2017-09-17 02:28:46.860866"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @idea.update(idea_params)